# PANDAS IN PYTHON

##### Pandas is an open source data analysis and manipulation library for python. it provides data structue and functions needed to work with structured data seamlessly and intuitively. the  primary data structure in pandas are:
   #### 1. series : A one-dimentional labeled array capable of holding any data type
   #### 2. DataFrame : A two-dimensional labeled data structure with columns of potentially different datatypes.

In [ ]:
# importing pandas

In [34]:
import pandas as pd

In [41]:
# creating blank series

In [40]:
import pandas as pd

# Create a blank series
blank_series = pd.Series()

print(blank_series)

Series([], dtype: object)

In [44]:
series = pd.Series([0,11,22,33,44,55,66,77,88,99])
print(series)

0     0
1    11
2    22
3    33
4    44
5    55
6    66
7    77
8    88
9    99
dtype: int64

# Creating  a dictionary

In [46]:
dictionary = {'f': [1,2,3], 'g': [4,8,9], 'h':[4,7,1]}
print(dictionary)

{'f': [1, 2, 3], 'g': [4, 8, 9], 'h': [4, 7, 1]}

# Creating a  Dataframe

In [47]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [54]:
info = {
    'name' : ['aman' , 'tom' , 'jim' , 'raj'],
    'state' : ['br' , 'gj' , 'tm', 'cn'],
    'salary' : [20000 , 30000, 49000, 5000]
}
d = pd.DataFrame(info)
print(d)

   name state  salary
0  aman    br   20000
1   tom    gj   30000
2   jim    tm   49000
3   raj    cn    5000

In [55]:
# add new column in table and add values

In [58]:
d['mobile']= "99,44,66,88".split(',')
print (d)

   name state  salary mobile
0  aman    br   20000     99
1   tom    gj   30000     44
2   jim    tm   49000     66
3   raj    cn    5000     88

In [59]:
# nan values

In [72]:
info = {
    'name' : ['aman' , 'tom' , np.nan , np.nan],
    'state' : ['br' , 'gj' , 'tm', 'cn'],
    'salary' : [20000 , 30000, 49000, np.nan]}
d = pd.DataFrame(info)
print(d)

   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0
2   NaN    tm  49000.0
3   NaN    cn      NaN

In [62]:
 # drop nan values // column

In [64]:
print("\n Dropping any column with nan value\n",'-'*35,sep='')
print(d.dropna(axis=1))  //

 Dropping any column with nan value
-----------------------------------
     name state
0    aman    br
1     tom    gj
2  np.nan    tm
3  np.nan    cn

In [73]:
print("\n Dropping any Rows with nan value\n",'-'*75,sep='')
print(d.dropna(axis=0))

 Dropping any Rows with nan value
---------------------------------------------------------------------------
   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0

In [74]:
# fill the position of nan with 99

In [77]:
print("\n Filling Value with 99 \t",'-'*8,sep='')
print(d.fillna(value=99))

 Filling Value with 99 	--------
   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0
2    99    tm  49000.0
3    99    cn     99.0

In [80]:
print("\n Filling Value with 00 \n",'-'*35,sep='')
print(d.fillna(value=00))

 Filling Value with 00
-----------------------------------
   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0
2     0    tm  49000.0
3     0    cn      0.0

In [81]:
print(d)

   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0
2   NaN    tm  49000.0
3   NaN    cn      NaN

In [84]:
print("\n Filling Values (mean of a column )\n",'-')
d.fillna(value=d['salary'].mean(),inplace=True)
print(d)

 Filling Values (mean of a column )
 -
      name state   salary
0     aman    br  20000.0
1      tom    gj  30000.0
2  33000.0    tm  49000.0
3  33000.0    cn  33000.0

In [85]:
 #find the mean company wise. firstly we have to group by column names using groupby

In [88]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})

In [89]:
print (df)

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [93]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [94]:
#Concating DataFrame 
#There are Three types of concating  -1 = Concat
#                                     2  = Merge
#                                     3 =  Join

In [95]:
info =pd.DataFrame({'Mat':[45,68,35,65],
                     'Eng':[54,87,36,52],
                     'Sci':[66,77,88,70],
                     'hindi':[54,79,58,76]},
                    index=['Ravi','Shyam','Saurav','Abhi'])

In [96]:
print(info)

        Mat  Eng  Sci  hindi
Ravi     45   54   66     54
Shyam    68   87   77     79
Saurav   35   36   88     58
Abhi     65   52   70     76

In [98]:
info_2=pd.DataFrame({'Mat':[45,68,35,95],
                     'Eng':[54,87,36,54],
                     'Sci':[66,77,88,72],
                     'hindi':[66,71,5,46]},
                    index=['aman','amit','rahul','ravi'])
info_2

       Mat  Eng  Sci  hindi
aman    45   54   66     66
amit    68   87   77     71
rahul   35   36   88      5
ravi    95   54   72     46

In [100]:
info_3= pd.DataFrame({'Mat':[0,8,95,5],
                     'Eng':[64,83,6,14],
                     'Sci':[66,77,18,72],
                     'hindi':[66,71,5,46]},
                    index=['akash','ankit','tom','ai'])
info_3

       Mat  Eng  Sci  hindi
akash    0   64   66     66
ankit    8   83   77     71
tom     95    6   18      5
ai       5   14   72     46

In [101]:
# concat row

In [102]:
all_student_marks=pd.concat([info,info_2,info_3],axis=0)
print("\n After concatenation along row \n",'-'*50,sep='')
print(all_student_marks)

 After concatenation along row
--------------------------------------------------
        Mat  Eng  Sci  hindi
Ravi     45   54   66     54
Shyam    68   87   77     79
Saurav   35   36   88     58
Abhi     65   52   70     76
aman     45   54   66     66
amit     68   87   77     71
rahul    35   36   88      5
ravi     95   54   72     46
akash     0   64   66     66
ankit     8   83   77     71
tom      95    6   18      5
ai        5   14   72     46

In [103]:
# concat column

In [104]:
all_student_marks=pd.concat([info,info_2,info_3],axis=1)
print("\n After concatenation along column\n",'-'*40,sep='')
print(all_student_marks)

 After concatenation along column
----------------------------------------
         Mat   Eng   Sci  hindi   Mat   Eng   Sci  hindi   Mat   Eng   Sci  \
Ravi    45.0  54.0  66.0   54.0   NaN   NaN   NaN    NaN   NaN   NaN   NaN
Shyam   68.0  87.0  77.0   79.0   NaN   NaN   NaN    NaN   NaN   NaN   NaN
Saurav  35.0  36.0  88.0   58.0   NaN   NaN   NaN    NaN   NaN   NaN   NaN
Abhi    65.0  52.0  70.0   76.0   NaN   NaN   NaN    NaN   NaN   NaN   NaN
aman     NaN   NaN   NaN    NaN  45.0  54.0  66.0   66.0   NaN   NaN   NaN
amit     NaN   NaN   NaN    NaN  68.0  87.0  77.0   71.0   NaN   NaN   NaN
rahul    NaN   NaN   NaN    NaN  35.0  36.0  88.0    5.0   NaN   NaN   NaN
ravi     NaN   NaN   NaN    NaN  95.0  54.0  72.0   46.0   NaN   NaN   NaN
akash    NaN   NaN   NaN    NaN   NaN   NaN   NaN    NaN   0.0  64.0  66.0
ankit    NaN   NaN   NaN    NaN   NaN   NaN   NaN    NaN   8.0  83.0  77.0
tom      NaN   NaN   NaN    NaN   NaN   NaN   NaN    NaN  95.0   6.0  18.0
ai       NaN   NaN   NaN    NaN   NaN   NaN   NaN    NaN   5.0  14.0  72.0

        hindi
Ravi      NaN
Shyam     NaN
Saurav    NaN
Abhi      NaN
aman      NaN
amit      NaN
rahul     NaN
ravi      NaN
akash    66.0
ankit    71.0
tom       5.0
ai       46.0

In [105]:
 # Fill all Nan Zero

In [113]:
all_student_marks.fillna(value=0,inplace=True)
print(all_student_marks)

         Mat   Eng   Sci  hindi   Mat   Eng   Sci  hindi   Mat   Eng   Sci  \
Ravi    45.0  54.0  66.0   54.0   0.0   0.0   0.0    0.0   0.0   0.0   0.0
Shyam   68.0  87.0  77.0   79.0   0.0   0.0   0.0    0.0   0.0   0.0   0.0
Saurav  35.0  36.0  88.0   58.0   0.0   0.0   0.0    0.0   0.0   0.0   0.0
Abhi    65.0  52.0  70.0   76.0   0.0   0.0   0.0    0.0   0.0   0.0   0.0
aman     0.0   0.0   0.0    0.0  45.0  54.0  66.0   66.0   0.0   0.0   0.0
amit     0.0   0.0   0.0    0.0  68.0  87.0  77.0   71.0   0.0   0.0   0.0
rahul    0.0   0.0   0.0    0.0  35.0  36.0  88.0    5.0   0.0   0.0   0.0
ravi     0.0   0.0   0.0    0.0  95.0  54.0  72.0   46.0   0.0   0.0   0.0
akash    0.0   0.0   0.0    0.0   0.0   0.0   0.0    0.0   0.0  64.0  66.0
ankit    0.0   0.0   0.0    0.0   0.0   0.0   0.0    0.0   8.0  83.0  77.0
tom      0.0   0.0   0.0    0.0   0.0   0.0   0.0    0.0  95.0   6.0  18.0
ai       0.0   0.0   0.0    0.0   0.0   0.0   0.0    0.0   5.0  14.0  72.0

        hindi
Ravi      0.0
Shyam     0.0
Saurav    0.0
Abhi      0.0
aman      0.0
amit      0.0
rahul     0.0
ravi      0.0
akash    66.0
ankit    71.0
tom       5.0
ai       46.0

# merge

In [117]:
student_id_name=pd.DataFrame({'ID':[25823,3045,3596,4022,4511,5023,5455],
                            'Name':['aman','abhi','rock','harry','tom','Pogba','jerry']})

In [119]:
student_id_name

      ID   Name
0  25823   aman
1   3045   abhi
2   3596   rock
3   4022  harry
4   4511    tom
5   5023  Pogba
6   5455  jerry

In [120]:
print(" student details are \t ------------------")
student_id_name

 student details are 	 ------------------

      ID   Name
0  25823   aman
1   3045   abhi
2   3596   rock
3   4022  harry
4   4511    tom
5   5023  Pogba
6   5455  jerry

In [122]:
student_detail=pd.DataFrame({'ID':[25823,3045,3596,4022,4511,5023,5455],
                            'Age':[36,34,20,28,37,70],
                            'Country':['Porugal','Argentina','England','France','India']})

ValueError: All arrays must be of the same length